Ran Plan for dir: `live/newsletter-server` workspace: `default`

<details><summary>Show Output</summary>

```diff
19:39:42.590 STDOUT tofu1.8.2: OpenTofu used the selected providers to generate the following execution
19:39:42.590 STDOUT tofu1.8.2: plan. Resource actions are indicated with the following symbols:
19:39:42.590 STDOUT tofu1.8.2:   + create
19:39:42.590 STDOUT tofu1.8.2:   ~ update in-place
19:39:42.590 STDOUT tofu1.8.2: -/+ destroy and then create replacement
19:39:42.591 STDOUT tofu1.8.2: OpenTofu will perform the following actions:
19:39:42.591 STDOUT tofu1.8.2:   # hcloud_firewall_attachment.this will be updated in-place
19:39:42.591 STDOUT tofu1.8.2:   ~ resource "hcloud_firewall_attachment" "this" {
19:39:42.591 STDOUT tofu1.8.2:         id              = "1587707"
19:39:42.591 STDOUT tofu1.8.2:       ~ server_ids      = [
19:39:42.591 STDOUT tofu1.8.2:           - 52684920,
19:39:42.591 STDOUT tofu1.8.2:         ] -> (known after apply)
19:39:42.591 STDOUT tofu1.8.2:         # (2 unchanged attributes hidden)
19:39:42.591 STDOUT tofu1.8.2:     }
19:39:42.591 STDOUT tofu1.8.2:   # hcloud_server.this must be replaced
19:39:42.591 STDOUT tofu1.8.2: -/+ resource "hcloud_server" "this" {
19:39:42.591 STDOUT tofu1.8.2:       + backup_window              = (known after apply)
19:39:42.591 STDOUT tofu1.8.2:       ~ datacenter                 = "nbg1-dc3" -> (known after apply)
19:39:42.591 STDOUT tofu1.8.2:       ~ firewall_ids               = [
19:39:42.591 STDOUT tofu1.8.2:           - 1587707,
19:39:42.591 STDOUT tofu1.8.2:         ] -> (known after apply)
19:39:42.591 STDOUT tofu1.8.2:       ~ id                         = "52684920" -> (known after apply)
19:39:42.592 STDOUT tofu1.8.2:       ~ ipv4_address               = "128.140.71.149" -> (known after apply)
19:39:42.592 STDOUT tofu1.8.2:       ~ ipv6_address               = "2a01:4f8:1c1b:68c6::1" -> (known after apply)
19:39:42.592 STDOUT tofu1.8.2:       ~ ipv6_network               = "2a01:4f8:1c1b:68c6::/64" -> (known after apply)
19:39:42.592 STDOUT tofu1.8.2:       - labels                     = {} -> null
19:39:42.592 STDOUT tofu1.8.2:         name                       = "personal"
19:39:42.592 STDOUT tofu1.8.2:       - placement_group_id         = 0 -> null
19:39:42.592 STDOUT tofu1.8.2:       ~ primary_disk_size          = 40 -> (known after apply)
19:39:42.592 STDOUT tofu1.8.2:       ~ status                     = "running" -> (known after apply)
19:39:42.592 STDOUT tofu1.8.2:       ~ user_data                  = (sensitive value) # forces replacement
19:39:42.593 STDOUT tofu1.8.2:         # (10 unchanged attributes hidden)
19:39:42.593 STDOUT tofu1.8.2:         # (1 unchanged block hidden)
19:39:42.593 STDOUT tofu1.8.2:     }
19:39:42.593 STDOUT tofu1.8.2:   # hcloud_server_network.this must be replaced
19:39:42.593 STDOUT tofu1.8.2: -/+ resource "hcloud_server_network" "this" {
19:39:42.593 STDOUT tofu1.8.2:       - alias_ips   = [] -> null
19:39:42.593 STDOUT tofu1.8.2:       ~ id          = "52684920-10090102" -> (known after apply)
19:39:42.593 STDOUT tofu1.8.2:       ~ ip          = "172.16.16.1" -> (known after apply)
19:39:42.593 STDOUT tofu1.8.2:       ~ mac_address = "86:00:00:fa:b1:cf" -> (known after apply)
19:39:42.593 STDOUT tofu1.8.2:       ~ server_id   = 52684920 # forces replacement -> (known after apply) # forces replacement
19:39:42.594 STDOUT tofu1.8.2:         # (1 unchanged attribute hidden)
19:39:42.594 STDOUT tofu1.8.2:     }
19:39:42.594 STDOUT tofu1.8.2:   # hcloud_volume_attachment.varlib must be replaced
19:39:42.594 STDOUT tofu1.8.2: -/+ resource "hcloud_volume_attachment" "varlib" {
19:39:42.594 STDOUT tofu1.8.2:       ~ id        = "101246358" -> (known after apply)
19:39:42.594 STDOUT tofu1.8.2:       ~ server_id = 52684920 # forces replacement -> (known after apply) # forces replacement
19:39:42.594 STDOUT tofu1.8.2:         # (2 unchanged attributes hidden)
19:39:42.594 STDOUT tofu1.8.2:     }
19:39:42.594 STDOUT tofu1.8.2:   # null_resource.example will be created
19:39:42.594 STDOUT tofu1.8.2:   + resource "null_resource" "example" {
19:39:42.594 STDOUT tofu1.8.2:       + id = (known after apply)
19:39:42.594 STDOUT tofu1.8.2:     }
19:39:42.594 STDOUT tofu1.8.2: Plan: 4 to add, 1 to change, 3 to destroy.
19:39:42.594 STDOUT tofu1.8.2: 
19:39:42.594 STDOUT tofu1.8.2: Changes to Outputs:
19:39:42.594 STDOUT tofu1.8.2:   ~ cloudinit_config = (sensitive value)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d live/newsletter-server
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.developer-friendly.blog/lock?id=meysam81%252Finfra%252Flive%252Fnewsletter-server%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d live/newsletter-server
  ```
Plan: 4 to add, 1 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```